In [1]:
# import the necessary libraries
import pandas as pd
import numpy as np

In [2]:
# create three different series
series1 = pd.Series(np.random.randint(1, 5, size=100))
series2 = pd.Series(np.random.randint(1, 4, size=100))
series3 = pd.Series(np.random.randint(10000, 30001, size=100))

In [3]:
# create a dataframe by joining the series by column
df = pd.concat([series1, series2, series3], axis=1)
df.head()

   0  1      2
0  4  2  14506
1  1  3  22206
2  4  3  16957
3  2  3  11173
4  2  1  27796

In [4]:
# change the name of the columns
df.columns = ['beds', 'bathes', 'price_per_meter']
df.head()

   beds  bathes  price_per_meter
0     4       2            14506
1     1       3            22206
2     4       3            16957
3     2       3            11173
4     2       1            27796

In [6]:
# create a one-column dataframe with the values of the three series
bigcolumn = pd.concat([series1, series2, series3])
bigcolumn.head()

0    4
1    1
2    4
3    2
4    2
dtype: int32

In [7]:
# check if it goes only until index 99
bigcolumn.index.max() == 99

True

In [8]:
# reindex the dataframe from 0 to 299
bigcolumn = bigcolumn.reset_index(drop=True).reindex(range(300))
bigcolumn

0          4
1          1
2          4
3          2
4          2
       ...
295    12321
296    24178
297    18597
298    24164
299    29928
Length: 300, dtype: int32